Revit 2026 API

# FacetingUtils Methods

---

The FacetingUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConvertTrianglesToQuads | Replaces pairs of adjacent, coplanar triangles by quadrilaterals. |

#### Reference

FacetingUtils Class

Autodesk.Revit.DB Namespace